smash> my_sleep
random1.txt
random2.txt
sub1
sub2
sub3
smash> smash> test_redirect
smash> smash> again_redirect
smash> smash> again_redirect
test_redirect
smash> smash> smash pid is 20480
smash> smash> smash pid is 20480
smash pid is 20480
smash> smash> smash pid is 20480
smash> mypid
my_sleep
new
random1.txt
random2.txt
sub1
sub2
sub3
smash> smash> smash> [1] sleep 100& : 20486 0 secs
smash> smash error: kill: invalid arguments
smash error: kill: invalid arguments
smash error: open failed: No such file or directory
smash error: dup failed: Bad file descriptor
/bin/bash: line 0: echo: write error: Bad file descriptor
smash error: dup failed: Bad file descriptor
ls: write error: Bad file descriptor
smash error: dup failed: Bad file descriptor
smash error: open failed: No such file or directory
ls: write error: Bad file descriptor
rm: cannot remove 'new': No such file or directory
smash error: dup failed: Bad file descriptor
smash error: open failed: No such file or directory
ls: write error: Bad file descriptor
rm: cannot remove 'new': No such file or directory
smash error: dup failed: Bad file descriptor
smash error: open failed: No such file or directory
smash error: dup failed: Bad file descriptor
smash error: open failed: No such file or directory
smash error: dup failed: Bad file descriptor
smash error: open failed: No such file or directory
